In [5]:
import json
import numpy as np, pandas as pd

# URL for JSON: https://unite-db.com/stats.json
# Convert to CSV: df.to_csv("uniteAggregate.csv", encoding='utf-8', index=False)

# Load data using Python JSON module
with open('data.json','r') as f:
    data = json.loads(f.read())

# Normalizing data
df = pd.json_normalize(data, record_path=["level"], meta=["name"])

# Create level column
df.insert(loc=0, column="lvl",
    value=np.tile([i for i in range(1,16)], 22))

df.head()

   lvl    hp  attack  defense sp_attack  sp_defense   name
0    1  3000     170       52        20          36  Absol
1    2  3107     186       59        23          41  Absol
2    3  3224     204       67        27          47  Absol
3    4  3353     223       76        31          53  Absol
4    5  3495     244       86        36          60  Absol

In [9]:
# Group data by level
grouped = df.groupby(["lvl"])

# Show all level 1 stats for each pokemon
grouped.get_group(1).head()

    lvl    hp  attack  defense sp_attack  sp_defense       name
0     1  3000     170       52        20          36      Absol
15    1  3278     143       40        40          30    Blissey
30    1  3200     161       70        20          34  Charizard
45    1  3000     135       50        20          30  Cinderace
60    1  3292     134       60        50          40  Cramorant